In [1]:
import pandas as pd

In [ ]:
# series de pandas
numeros = {"simples": [3,4,5,6]}
serie = pd.Series(numeros)
serie, type(serie)

(0    3
 1    4
 2    5
 3    6
 dtype: int64,
 pandas.core.series.Series)

In [2]:
data = {
    "Nombre": ["pepe","marcela","tuki"],
    "Edad": [22,43,12],
    "Deporte": ["Futbol","Tennis","Natacion"]
}

data, type(data)

({'Nombre': ['pepe', 'marcela', 'tuki'],
  'Edad': [22, 43, 12],
  'Deporte': ['Futbol', 'Tennis', 'Natacion']},
 dict)

In [3]:
df = pd.DataFrame(data=data)
df

    Nombre  Edad   Deporte
0     pepe    22    Futbol
1  marcela    43    Tennis
2     tuki    12  Natacion

In [4]:
#Exportar DataFrame
df.to_csv("data.csv")

In [5]:
#Importar un DataFrame
import_df = pd.read_csv("truedata.csv", index_col=0)
import_df

FileNotFoundError: [Errno 2] No such file or directory: 'truedata.csv'

In [6]:
nombres = df["Nombre"]
print(nombres)

0       pepe
1    marcela
2       tuki
Name: Nombre, dtype: object

In [7]:
#Seleccionar una o mas columnas
allNamesAndAges = df[["Nombre","Edad"]]
print(allNamesAndAges)

    Nombre  Edad
0     pepe    22
1  marcela    43
2     tuki    12

In [8]:
#Filtrar por indice
fila = df.loc[1]
print(fila)

Nombre     marcela
Edad            43
Deporte     Tennis
Name: 1, dtype: object

In [9]:
#Filtrar por un indice
ageUpperToTwenty = df[df["Nombre"] == "pepe"]
print(ageUpperToTwenty)

  Nombre  Edad Deporte
0   pepe    22  Futbol

In [10]:
filtro = (df["Edad"] > 20) & (df["Nombre"].str.startswith("p"))
df[filtro]

  Nombre  Edad Deporte
0   pepe    22  Futbol

In [11]:
df[df["Nombre"].isin(["Ana","tuki","marcela"])]

    Nombre  Edad   Deporte
1  marcela    43    Tennis
2     tuki    12  Natacion

In [12]:
#Manejar por longitud de letras el nombre
def longitud_5(nombre):
    return len(nombre) == 4

df[df["Nombre"].apply(longitud_5)]

  Nombre  Edad   Deporte
0   pepe    22    Futbol
2   tuki    12  Natacion

In [ ]:
def

In [50]:
def mayorEdad(edad):
    return edad > 4

df[df["Edad"].apply(mayorEdad)]

    Nombre  Edad   Deporte
0     pepe    22    Futbol
1  marcela    43    Tennis
2     tuki    12  Natacion

In [6]:
df[(df["Edad"].between(12,43))&(df["Deporte"].isin(["Futbol","Tennis"]))]

    Nombre  Edad Deporte
0     pepe    22  Futbol
1  marcela    43  Tennis

In [2]:
import numpy as np

In [4]:
data = {
    "Nombre": ["pepe","marcela","tuki","NewGuy","SecondNew"],
    "Edad": [22,43,12,np.nan,17],
    "Deporte": ["Futbol","Tennis","Natacion",None,None]
}

df = pd.DataFrame(data)
df

      Nombre  Edad   Deporte
0       pepe  22.0    Futbol
1    marcela  43.0    Tennis
2       tuki  12.0  Natacion
3     NewGuy   NaN      None
4  SecondNew  17.0      None

In [5]:
df_fill = df.fillna(
	{
		"Edad" : df["Edad"].mean(),
		"Deporte" : "No tiene deporte"
	}
)
df_fill

      Nombre  Edad           Deporte
0       pepe  22.0            Futbol
1    marcela  43.0            Tennis
2       tuki  12.0          Natacion
3     NewGuy  23.5  No tiene deporte
4  SecondNew  17.0  No tiene deporte

In [11]:
df_sin = df.dropna()

print(df_sin)

    Nombre  Edad   Deporte
0     pepe  22.0    Futbol
1  marcela  43.0    Tennis
2     tuki  12.0  Natacion

In [12]:
df_sin_data = df.dropna()

df_sin_data

    Nombre  Edad   Deporte
0     pepe  22.0    Futbol
1  marcela  43.0    Tennis
2     tuki  12.0  Natacion

In [10]:
df_reem = df.replace(
    {
    "Deporte": {None : "aqui habia none :v"}
    }
)
df_reem

      Nombre  Edad             Deporte
0       pepe  22.0              Futbol
1    marcela  43.0              Tennis
2       tuki  12.0            Natacion
3     NewGuy   NaN  aqui habia none :v
4  SecondNew  17.0  aqui habia none :v

In [18]:
#Interpolar valores 
df_interpolado = df.copy()
df_interpolado["Edad"] = df["Edad"].interpolate()
df_interpolado

      Nombre  Edad   Deporte
0       pepe  22.0    Futbol
1    marcela  43.0    Tennis
2       tuki  12.0  Natacion
3     NewGuy  14.5      None
4  SecondNew  17.0      None

In [7]:
#Remplazar valores especificos de una columna
data_duplicada = {
    "Nombre": ["pepe","marcela","tuki","NewGuy","SecondNew","SecondNew","Marcelo"],
    "Edad": [22,43,12,np.nan,17,17,34],
    "Deporte": ["Futbol","Tennis","Natacion",None,None,None,"Voleyball"]
}

In [8]:
df_duplicada = pd.DataFrame(data_duplicada)

In [20]:
df_sin_duplicados = df_duplicada.drop_duplicates()
df_sin_duplicados

      Nombre  Edad    Deporte
0       pepe  22.0     Futbol
1    marcela  43.0     Tennis
2       tuki  12.0   Natacion
3     NewGuy   NaN       None
4  SecondNew  17.0       None
6    Marcelo  34.0  Voleyball

In [ ]:
columnas_ordeanas = ["Edad","Nombre","Deporte"]
df_ordenado = df[columnas_ordeanas]
df_ordenado

   Edad     Nombre   Deporte
0  22.0       pepe    Futbol
1  43.0    marcela    Tennis
2  12.0       tuki  Natacion
3   NaN     NewGuy      None
4  17.0  SecondNew      None

:

In [12]:
#Transformacion de datos 
def cuadrado(x):
    return x**2

df["Edad_cuadrado"] = df["Edad"].apply(cuadrado)
df

  Nombre     Ciudad  Edad  Puntuacion  Edad_cuadrado
0   Juan     Madrid    23          23            529
1  Pedro  Barcelona    34          80           1156
2   Luis     Madrid    30          95            900
3  Laura   Valencia    28          78            784
4  Pedro  Barcelona    38          98           1444

In [21]:
data = {
    "Nombre" : ['Juan','Pedro','Luis','Laura','Pedro'],
    'Ciudad' : ['Madrid','Barcelona','Madrid','Valencia','Barcelona'],
    'Edad' : [23,34,30,28,38],
    'Puntuacion' : [23,80,95,78,98]
}

df = pd.DataFrame(data)
df

  Nombre     Ciudad  Edad  Puntuacion
0   Juan     Madrid    23          23
1  Pedro  Barcelona    34          80
2   Luis     Madrid    30          95
3  Laura   Valencia    28          78
4  Pedro  Barcelona    38          98

In [22]:
#Agrupar los datos por ciudad
grouped = df.groupby("Ciudad")
print(grouped.groups)

{'Barcelona': [1, 4], 'Madrid': [0, 2], 'Valencia': [3]}

In [23]:
aggregated_data = grouped.agg(
    {
        "Edad": "sum",
        "Puntuacion": "sum"
    }
)
aggregated_data

           Edad  Puntuacion
Ciudad
Barcelona    72         178
Madrid       53         118
Valencia     28          78

In [18]:
def rango(series):
    return series.max() - series.min()

def sum(series):
    return series.sum()

def mean(series):
    return series.mean()

aggregated_data_custom = grouped.agg(
    {
        "Edad":rango,
        "Puntuacion":sum
    }
)
print(aggregated_data_custom)

           Edad  Puntuacion
Ciudad
Barcelona     4         178
Madrid        7         118
Valencia      0          78

In [19]:
data

{'Nombre': ['Juan', 'Pedro', 'Luis', 'Laura', 'Pedro'],
 'Ciudad': ['Madrid', 'Barcelona', 'Madrid', 'Valencia', 'Barcelona'],
 'Edad': [23, 34, 30, 28, 38],
 'Puntuacion': [23, 80, 95, 78, 98]}

In [20]:
data["Categoria"] = ["A","B","A","B","A"]
df = pd.DataFrame(data)
df

  Nombre     Ciudad  Edad  Puntuacion Categoria
0   Juan     Madrid    23          23         A
1  Pedro  Barcelona    34          80         B
2   Luis     Madrid    30          95         A
3  Laura   Valencia    28          78         B
4  Pedro  Barcelona    38          98         A

In [21]:
#Agrupar datos por ciudad y categoria
grouped_by_ciudad_and_categoria = df.groupby(["Ciudad", "Categoria"])
grouped_by_ciudad_and_categoria.groups

{('Barcelona', 'A'): [4], ('Barcelona', 'B'): [1], ('Madrid', 'A'): [0, 2], ('Valencia', 'B'): [3]}

In [22]:
#Calcular la suma de edades y puntuacion por ciduad y categoria
aggregated_mutli_data = grouped_by_ciudad_and_categoria.agg(
    {
        "Edad":"sum",
        "Puntuacion":"mean"
    }
)
aggregated_mutli_data

                     Edad  Puntuacion
Ciudad    Categoria
Barcelona A            38        98.0
          B            34        80.0
Madrid    A            53        59.0
Valencia  B            28        78.0

In [12]:
#Agregando a una columna
#Vamos a crear un dataFrame de ejemplo
data = {
    'Nombre' : ['Juan','Ana','Luis','Laura'],
    'Edad' : [25,33,30,28]
}

df = pd.DataFrame(data)
df

  Nombre  Edad
0   Juan    25
1    Ana    33
2   Luis    30
3  Laura    28

In [13]:
#Agregar una columna
df["Ciudad"] = ["Barcelona","Madrid","New York","Valencia"]
df

  Nombre  Edad     Ciudad
0   Juan    25  Barcelona
1    Ana    33     Madrid
2   Luis    30   New York
3  Laura    28   Valencia

In [14]:
new_row = pd.Series({'Nombre':'Miguel', 'Edad':23, 'Ciudad':'Buenos Aires'})

#Agregamos a la fila del DataFrame
df = pd.concat([df, new_row.to_frame().T],ignore_index=True)
df

   Nombre Edad        Ciudad
0    Juan   25     Barcelona
1     Ana   33        Madrid
2    Luis   30      New York
3   Laura   28      Valencia
4  Miguel   23  Buenos Aires

In [18]:
nuevos_usuarios = [
    {'Nombre': 'Alex', 'Edad': 18, 'Ciudad': 'Bucaramanga'},
    {'Nombre': 'Angie', 'Edad': 21, 'Ciudad': 'Floridablanca'}
]

df_nuevos = pd.DataFrame(nuevos_usuarios)


df = pd.concat([df, df_nuevos], ignore_index=True)
df

   Nombre Edad         Ciudad
0    Juan   25      Barcelona
1     Ana   33         Madrid
2    Luis   30       New York
3   Laura   28       Valencia
4  Miguel   23   Buenos Aires
5    Alex   18    Bucaramanga
6   Angie   21  Floridablanca
7    Alex   18    Bucaramanga
8   Angie   21  Floridablanca

In [20]:
df_sin_duplicados = df.drop_duplicates()

df_sin_duplicados

   Nombre Edad         Ciudad
0    Juan   25      Barcelona
1     Ana   33         Madrid
2    Luis   30       New York
3   Laura   28       Valencia
4  Miguel   23   Buenos Aires
5    Alex   18    Bucaramanga
6   Angie   21  Floridablanca

In [26]:
usurios_ultima_hora = [
    {'Nombre': 'Mathis', 'Age':20, 'Ciudad':'Houston'}, 
    {'Nombre': 'Sophia', 'Age':10, 'Ciudad':'Beneci'}
]

new_users_late = pd.DataFrame(usurios_ultima_hora)

df = pd.concat([df, new_users_late], ignore_index=True)
df

   Nombre     Ciudad  Edad  Puntuacion   Age
0    Juan     Madrid  23.0        23.0   NaN
1   Pedro  Barcelona  34.0        80.0   NaN
2    Luis     Madrid  30.0        95.0   NaN
3   Laura   Valencia  28.0        78.0   NaN
4   Pedro  Barcelona  38.0        98.0   NaN
5  Mathis    Houston   NaN         NaN  20.0
6  Sophia     Beneci   NaN         NaN  10.0
7  Mathis    Houston   NaN         NaN  20.0
8  Sophia     Beneci   NaN         NaN  10.0